In [1]:
# import Libraries
import pandas as pd
import numpy as np
import os

In [2]:
path=r"C:\Users\abdul\Career-Foundry-Assignment4-Instacart-Basket-Analysis"

# Part1:

1.Download the customer data set and add it to your “Original Data” folder.

Answer: Done

2.Create a new notebook in your “Scripts” folder for part 1 of this task.

Answer:done

3.Import your analysis libraries, as well as your new customer data set as a dataframe.

Answer:done

In [3]:
df_custmr=pd.read_csv(os.path.join(path, '02_Data', 'Original-Data', 'customers.csv'))

In [4]:
df_custmr.head(5)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [7]:
df_custmr.shape

(206209, 10)

4. Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.

Answer: Done

In [5]:
df_custmr.rename(columns={'fam_status':'family_status', 'n_dependants':'number_of_dependants'}, inplace=True)

In [6]:
df_custmr.head(5)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,number_of_dependants,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

5. Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

Answer: Done

In [7]:
df_custmr.shape

(206209, 10)

In [8]:
#Checking the descriptive statistics
df_custmr.describe()

             user_id            Age  number_of_dependants         income
count  206209.000000  206209.000000         206209.000000  206209.000000
mean   103105.000000      49.501646              1.499823   94632.852548
std     59527.555167      18.480962              1.118433   42473.786988
min         1.000000      18.000000              0.000000   25903.000000
25%     51553.000000      33.000000              0.000000   59874.000000
50%    103105.000000      49.000000              1.000000   93547.000000
75%    154657.000000      66.000000              3.000000  124244.000000
max    206209.000000      81.000000              3.000000  593901.000000

In [9]:
# checking for null values
df_custmr.isnull().sum()

user_id                     0
First Name              11259
Surnam                      0
Gender                      0
STATE                       0
Age                         0
date_joined                 0
number_of_dependants        0
family_status               0
income                      0
dtype: int64

In [10]:
df_nan=df_custmr[df_custmr['First Name'].isnull()== True]

In [11]:
df_nan

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,number_of_dependants,family_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

In [12]:
df_nan.shape

(11259, 10)

In [13]:
#Cleaning the null values.
df_custmr_clean=df_custmr[df_custmr['First Name'].isnull()==False]

In [14]:
df_custmr_clean.shape

(194950, 10)

In [15]:
#Checking wether null values are cleaned or not
df_custmr_clean.isnull().sum()

user_id                 0
First Name              0
Surnam                  0
Gender                  0
STATE                   0
Age                     0
date_joined             0
number_of_dependants    0
family_status           0
income                  0
dtype: int64

In [16]:
df_custmr_clean.describe()

             user_id            Age  number_of_dependants         income
count  194950.000000  194950.000000         194950.000000  194950.000000
mean   103140.014947      49.511167              1.499600   94664.811495
std     59527.705810      18.476519              1.117959   42477.262653
min         1.000000      18.000000              0.000000   25903.000000
25%     51597.250000      33.000000              0.000000   59924.000000
50%    103091.500000      49.000000              1.000000   93572.500000
75%    154700.750000      66.000000              2.000000  124261.000000
max    206209.000000      81.000000              3.000000  593901.000000

In [17]:
# checking for duplicates
df_dups=df_custmr_clean[df_custmr_clean.duplicated()]

In [18]:
df_dups

Empty DataFrame
Columns: [user_id, First Name, Surnam, Gender, STATE, Age, date_joined, number_of_dependants, family_status, income]
Index: []

In [19]:
df_dups.shape

(0, 10)

In [20]:
# Check for mixed types
for col in df_custmr_clean.columns.tolist():
  weird = (df_custmr_clean[[col]].applymap(type) != df_custmr_clean[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_custmr_clean[weird]) > 0:
    print (col, ':mix')
  else: print(col, ':consistent')

user_id :consistent
First Name :consistent
Surnam :consistent
Gender :consistent
STATE :consistent
Age :consistent
date_joined :consistent
number_of_dependants :consistent
family_status :consistent
income :consistent

6.Combine your customer data with the rest of your prepared Instacart data. (Hint: Make sure the key columns are the same data type!)

Answer: Done

In [21]:
df_ords_prods_merge=pd.read_pickle(os.path.join(path,'02_Data','Prepared-Data','ords_prods_merg_up_48_cl.pkl'))

In [22]:
df_ords_prods_merge.head(5)

,Unnamed: 0.1,Unnamed: 0_x,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,...,department_id,prices,Busiest days,busiest_period_of_day,max_order,loyalty_flag,average_price,spending_flag,days_since_prior_order_median,criteria_flag
0,0,0,2539329,1,prior,1,2,8,7.0,196,...,7,9.0,Regularly Busy Days,Average Orders,10,New Customer,6.367797,Low spender,20.0,Regular Customer
1,1,1,2398795,1,prior,2,3,7,15.0,196,...,7,9.0,Least Busy Days,Average Orders,10,New Customer,6.367797,Low spender,20.0,Regular Customer
2,2,2,473747,1,prior,3,3,12,21.0,196,...,7,9.0,Least Busy Days,Most Orders,10,New Customer,6.367797,Low spender,20.0,Regular Customer
3,3,3,2254736,1,prior,4,4,7,29.0,196,...,7,9.0,Least Busy Days,Average Orders,10,New Customer,6.367797,Low spender,20.0,Regular Customer
4,4,4,431534,1,prior,5,4,15,28.0,196,...,7,9.0,Least Busy Days,Most Orders,10,New Customer,6.367797,Low spender,20.0,Regular Customer

In [23]:
df_ords_prods_merge.shape

(32399732, 25)

In [24]:
df_ords_prods_cust=pd.merge(df_ords_prods_merge,df_custmr_clean,on='user_id',indicator= True, how= 'outer')

In [25]:
df_ords_prods_cust.head(5)

,Unnamed: 0.1,Unnamed: 0_x,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,...,First Name,Surnam,Gender,STATE,Age,date_joined,number_of_dependants,family_status,income,_merge
0,0,0,2539329,1,prior,1,2,8,7.0,196,...,Linda,Nguyen,Female,Alabama,31.0,2/17/2019,3.0,married,40423.0,both
1,1,1,2398795,1,prior,2,3,7,15.0,196,...,Linda,Nguyen,Female,Alabama,31.0,2/17/2019,3.0,married,40423.0,both
2,2,2,473747,1,prior,3,3,12,21.0,196,...,Linda,Nguyen,Female,Alabama,31.0,2/17/2019,3.0,married,40423.0,both
3,3,3,2254736,1,prior,4,4,7,29.0,196,...,Linda,Nguyen,Female,Alabama,31.0,2/17/2019,3.0,married,40423.0,both
4,4,4,431534,1,prior,5,4,15,28.0,196,...,Linda,Nguyen,Female,Alabama,31.0,2/17/2019,3.0,married,40423.0,both

In [26]:
df_ords_prods_cust.shape

(32399732, 35)

7.Ensure your notebook contains logical titles, section headings, and descriptive code comments.

Answer:done

8.Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.

Answer:done

In [27]:
df_ords_prods_cust.to_pickle(os.path.join(path, '02_Data','Prepared-Data','ords_prods_cust.pkl'))

9.Save your notebook so that you can send it to your tutor for review after completing part 2.

Answer:done